app/controllers/airplanes_controller.rb

  def create
    @airplane = Airplane.new(airplane_params)

    respond_to do |format|
      if @airplane.save
---
INSERT INTO "airplanes" ("name", "rows", "columns", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "New Airplane"], ["rows", 4], ["columns", 4], ["created_at", "2018-04-17 23:42:08.983677"], ["updated_at", "2018-04-17 23:42:08.983677"]]

    def set_airplane
      @airplane = Airplane.find(params[:id])
---
SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]